# Brew File

# Sources
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/php"
tap "homebrew/services"
tap "homebrew/versions"
tap "neovim/neovim"


# Application
brew "tmux"
brew "vim"
brew "neovim"


# Vim Plugin Manager
brew "zplug"

# Environemnt Manager

# Node Versions Manager
brew "nvm"

# Python versions manager
brew "pyenv"

# Ruby versions manager↵
brew "rbenv"
# Ruby versions manager

# Compile and install Ruby
brew "ruby-build"

# PHP versions manager
brew "phpbrew"


# Networking
# SSH Manager
brew "stormssh"

# HTTP CLI Client
brew "httpie"

# Bring SSH config
brew "sshrc"


# CLI Utilities
brew "thefuck"
brew "the_silver_searcher"
brew "ack"
brew "exa" # is a modern replacement for ls
# Workspace manager
brew "desk"

# A static analysis tool for shell scripts
brew "shellcheck"

# Rest in peace, Grep
brew "ripgrep"

# GIT utilities
brew "git-extras"
brew "reattach-to-user-namespace"
# Integrate with GitHub
brew "hub"


# Default libs
brew "automake"
brew "autoconf"
brew "curl"
brew "pcre"
brew "bison"
brew "re2c"
brew "mhash"
brew "libtool"
brew "icu4c"
brew "gettext"
brew "jpeg"
brew "openssl"
brew "libxml2"
brew "mcrypt"
brew "gmp"
brew "libevent"
brew "imagemagick"
brew "zlib"


# Zsh


# Cask
# cask "iterm2"


# vim:foldmethod=marker:foldlevel=0